Revit 2027 API
ZoneEquipmentData.EquipmentType Property
 The type of zone equipment. Note this property would reset other properties.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoneEquipmentHvacType EquipmentType { get; set; }
Public Property EquipmentType As ZoneEquipmentHvacType
	Get
	Set
public:
property ZoneEquipmentHvacType EquipmentType {
	ZoneEquipmentHvacType get ();
	void set (ZoneEquipmentHvacType value);
}
member EquipmentType : ZoneEquipmentHvacType with get, set
Property Value
ZoneEquipmentHvacType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ZoneEquipmentData Class
Autodesk.Revit.DB.Mechanical Namespace